tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "dart-lang/dart"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "pkgxdev/made"
tap "pulumi/tap"
tap "universal-ctags/universal-ctags"
# Run your GitHub Actions locally
brew "act"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Ruby environment tool
brew "chruby"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: true
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# YAML Parser
brew "libyaml"
# Utility for rendering projects templates
brew "copier"
# Command-line csv viewer
brew "csvlens"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# QUIC transport protocol implementation
brew "mvfst"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Handy way to save and run project-specific commands
brew "just"
# Easy way to access the system keyring service from python
brew "keyring"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Parser generator tool and incremental parsing library
brew "tree-sitter", link: false
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# Shell command parallelization utility
brew "parallel"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Rust toolchain installer
brew "rustup-init"
# Automate your tmux workflow
brew "smug"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# SDK
brew "dart-lang/dart/dart"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler", link: false
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Terraform
brew "hashicorp/tap/terraform"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Run Anything
brew "pkgxdev/made/pkgx"
# Pulumi ESC - Manage Environments, Secrets, and Configuration
brew "pulumi/tap/esc"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
# Universal database tool and SQL client
cask "dbeaver-community"
# All-in-one toolbox for developers
cask "devutils"
cask "font-0xproto-nerd-font"
cask "font-hack-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Offline AI chat tool
cask "jan"
# Kubernetes IDE
cask "lens"
# Customise mouse behavior
cask "linearmouse"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Browser for ambitious developers
cask "polypane"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on Wireguard
cask "tailscale"
# Open-source BitTorrent client
cask "transmission"
mas "AdGuard for Safari", id: 1440147259
mas "Alto's Adventure", id: 1287752517
mas "Alto's Odyssey", id: 1495097700
mas "Amphetamine", id: 937984704
mas "Asphalt 8+", id: 1563005359
mas "Auto HD FPS for YouTube", id: 1546729687
mas "Be Focused", id: 973134470
mas "Boop", id: 1518425043
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "Couverture", id: 1552415914
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "Doodle God Universe", id: 1539947531
mas "Final Cut Pro", id: 424389933
mas "Friendly Streaming", id: 553245401
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "Hidden Bar", id: 1452453066
mas "Houseparty", id: 1381523962
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "LilyView", id: 529490330
mas "Linearity Curve", id: 1219074514
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Memory Diag", id: 748212890
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Mini Motorways", id: 1456188526
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Viewer", id: 1120099014
mas "PiPer", id: 1421915518
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Save to Pocket", id: 1477385213
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Stela", id: 1476456353
mas "Stockfish", id: 801463932
mas "Tampermonkey", id: 1482490089
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "WhatFont", id: 1437138382
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
