tap "adoptopenjdk/openjdk", trusted: true
tap "anomalyco/tap", trusted: true
tap "asmvik/formulae", trusted: true
tap "aws/tap"
tap "dart-lang/dart"
tap "dopplerhq/doppler", trusted: true
tap "felixkratz/formulae", trusted: true
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jdx/tap"
tap "jnsahaj/lumen"
tap "jstkdng/programs"
tap "lightpanda-io/browser"
tap "local/yabai", trusted: true
tap "modem-dev/tap", trusted: true
tap "montanaflynn/tap"
tap "nikitabobko/tap", trusted: true
tap "oven-sh/bun"
tap "performave/tap"
tap "pkgxdev/made"
tap "pulumi/tap"
tap "sachaos/todoist"
tap "terrastruct/tap"
tap "tw93/tap"
tap "universal-ctags/universal-ctags", trusted: true
# Run your GitHub Actions locally
brew "act"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Memory upgrade for your coding agent
brew "beads"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Insanely fast image printing in your terminal
brew "catimg"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Ruby environment tool
brew "chruby"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# YAML Parser
brew "libyaml"
# Utility for rendering projects templates
brew "copier"
# Command-line csv viewer
brew "csvlens"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# CLI for interacting with Doppler secrets and configuration
brew "doppler"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Portable Foreign Function Interface library
brew "libffi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Apt for fonts, the missing font manager for macOS/linux
brew "fnt"
# Command-line fuzzy finder written in Go
brew "fzf"
# Multi-agent workspace manager
brew "gastown"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Client library for huggingface.co hub
brew "hf"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Website copier/offline browser
brew "httrack"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Easy way to access the system keyring service from python
brew "keyring"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# LLM inference in C/C++
brew "llama.cpp"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# QUIC transport protocol implementation
brew "mvfst"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell command parallelization utility
brew "parallel"
# Simplistic interactive filtering tool
brew "peco"
# AI agent toolkit
brew "pi-coding-agent"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Messaging and streaming broker
brew "rabbitmq"
# SVG rendering tool and library
brew "resvg"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Database of common MIME types
brew "shared-mime-info"
# Fuzzy Finder in rust!
brew "sk"
# Automate your tmux workflow
brew "smug"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli", trusted: true
# SDK
brew "dart-lang/dart/dart", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Vault
brew "hashicorp/tap/vault", trusted: true
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer", trusted: true
# Fast Node.js package manager
brew "jdx/tap/aube", trusted: true
# lumen is a command-line tool that can show pretty diff, generate commit messages with AI, summarise diffs / commits, and more without requiring an API key.
brew "jnsahaj/lumen/lumen", trusted: true
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp", trusted: true
# Puppeteer for terminal UIs — drive vim, htop, nethack from a CLI or agent
brew "montanaflynn/tap/ht", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# Tiling window manager for macOS (yabai fork with extra patches)
brew "performave/tap/yabai-plus", trusted: true
# Run Anything
brew "pkgxdev/made/pkgx", trusted: true
# Pulumi ESC - Manage Environments, Secrets, and Configuration
brew "pulumi/tap/esc", trusted: true
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi", trusted: true
# Todoist CLI client
brew "sachaos/todoist/todoist", trusted: true
# Advanced diagram layout engine for D2
brew "terrastruct/tap/tala", trusted: true
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole", trusted: true
# GPU-accelerated terminal emulator
cask "alacritty"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Web debugging Proxy application
cask "charles"
# Terminal-based AI coding assistant
cask "claude-code"
# Run Stable Diffusion locally
cask "diffusionbee"
# Offline voice-to-text dictation app with AI enhancement
cask "fluidvoice"
cask "font-0xproto-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Offline AI chat tool
cask "jan"
# Free and open-source media player
cask "kodi"
# Kubernetes IDE
cask "lens"
# Customise mouse behavior
cask "linearmouse"
# VPN client
cask "mullvad-vpn"
# Game launcher with the ability to run Windows games
cask "mythic"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# System monitor for the menu bar
cask "stats"
# Companion app for Stremio Web
cask "stremioservice"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# To-do list
cask "todoist-app"
# Open-source BitTorrent client
cask "transmission"
# Native desktop client for WhatsApp
cask "whatsapp"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Multiplayer code editor
cask "zed"
