tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "dart-lang/dart"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pkgxdev/made"
tap "pulumi/tap"
tap "sachaos/todoist"
tap "sst/tap"
tap "tw93/tap"
tap "universal-ctags/universal-ctags"
# Run your GitHub Actions locally
brew "act"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Insanely fast image printing in your terminal
brew "catimg"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Ruby environment tool
brew "chruby"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU compiler collection
brew "gcc"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# YAML Parser
brew "libyaml"
# Utility for rendering projects templates
brew "copier"
# Command-line csv viewer
brew "csvlens"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Apt for fonts, the missing font manager for macOS/linux
brew "fnt"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# AI assistant in your terminal
brew "gptme"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Website copier/offline browser
brew "httrack"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Easy way to access the system keyring service from python
brew "keyring"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# QUIC transport protocol implementation
brew "mvfst"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell command parallelization utility
brew "parallel"
# Simplistic interactive filtering tool
brew "peco"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Messaging and streaming broker
brew "rabbitmq"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Intuitive find & replace CLI
brew "sd"
# Automate your tmux workflow
brew "smug"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# SDK
brew "dart-lang/dart/dart"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Run Anything
brew "pkgxdev/made/pkgx"
# Pulumi ESC - Manage Environments, Secrets, and Configuration
brew "pulumi/tap/esc"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Todoist CLI client
brew "sachaos/todoist/todoist", link: false
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Universal database tool and SQL client
cask "dbeaver-community"
# All-in-one toolbox for developers
cask "devutils"
# Run Stable Diffusion locally
cask "diffusionbee"
# API documentation viewer
cask "dteoh-devdocs"
cask "font-0xproto-nerd-font"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Offline AI chat tool
cask "jan"
# Free and open-source media player
cask "kodi"
# Kubernetes IDE
cask "lens"
# Customise mouse behavior
cask "linearmouse"
# Game launcher with the ability to run Windows games
cask "mythic"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Browser for ambitious developers
cask "polypane"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# To-do list
cask "todoist-app"
# Open-source BitTorrent client
cask "transmission"
# Native desktop client for WhatsApp
cask "whatsapp"
